SET FOREIGN_KEY_CHECKS=0;

DROP TABLE IF EXISTS `wst_attributes`;
CREATE TABLE `wst_attributes` (
  `attrId` int(11) NOT NULL AUTO_INCREMENT,
  `goodsCatId` int(11) NOT NULL DEFAULT '0',
  `goodsCatPath` varchar(100) NOT NULL,
  `attrName` varchar(100) NOT NULL,
  `attrType` tinyint(4) NOT NULL DEFAULT '0',
  `attrVal` text,
  `attrSort` int(11) NOT NULL DEFAULT '0',
  `isShow` tinyint(4) DEFAULT '1',
  `dataFlag` tinyint(4) NOT NULL DEFAULT '1',
  `createTime` datetime NOT NULL,
  PRIMARY KEY (`attrId`),
  KEY `shopId` (`goodsCatId`,`isShow`,`dataFlag`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;


INSERT INTO `wst_attributes` VALUES ('1', '47', '47_', '产地', '0', '', '0', '1', '1', '2016-12-23 18:50:45'),
('2', '47', '47_', '销售规格', '0', '', '0', '1', '1', '2016-12-23 18:51:08'),
('3', '47', '47_', '商品单重', '0', '', '0', '1', '1', '2016-12-23 18:51:17'),
('4', '47', '47_', '储藏方法', '0', '', '0', '1', '1', '2016-12-23 18:51:24'),
('5', '47', '47_', '营养元素', '0', '', '0', '1', '1', '2016-12-23 18:51:33'),
('6', '47', '47_', '保鲜期', '0', '', '0', '1', '1', '2016-12-23 18:52:19'),
('7', '334', '334_', '上市时间', '0', '', '0', '1', '1', '2016-12-26 14:48:01'),
('8', '334', '334_', '网络类型', '2', '移动4G,联通4G,全网通', '0', '1', '1', '2016-12-26 14:49:47'),
('9', '334', '334_', '尺寸', '2', '5.0,5.1,4.7', '0', '1', '1', '2016-12-26 14:51:25'),
('10', '351', '334_348_351_', '摄像头', '2', '2400万,1800万,1300万,800万,500万', '0', '1', '1', '2016-12-26 14:52:11'),
('11', '351', '334_348_351_', '存储容量', '1', '16GB,32GB,64GB,128GB', '0', '1', '1', '2016-12-26 14:52:41'),
('12', '351', '334_348_351_', '手机类型', '1', '拍照手机,音乐手机,时尚手机,智能手机,3G手机,4G手机,商务手机,女性手机', '0', '1', '1', '2016-12-26 14:53:16'),
('13', '351', '334_348_351_', '视频显示格式', '2', '1080P,1024P', '0', '1', '1', '2016-12-26 14:54:37'),
('14', '351', '334_348_351_', '机身颜色', '1', '白色,银色,金色,蓝色,灰色', '0', '1', '1', '2016-12-26 14:55:34'),
('15', '334', '334_', '操作系统', '2', 'Android/安卓,IOS/苹果', '0', '1', '1', '2016-12-26 14:57:53'),
('16', '351', '334_348_351_', '触摸屏类型', '0', '', '0', '1', '1', '2016-12-26 14:58:16'),
('17', '351', '334_348_351_', '运行内存', '0', '', '0', '1', '1', '2016-12-26 14:58:30'),
('18', '351', '334_348_351_', '附加功能', '0', '', '0', '1', '1', '2016-12-26 14:59:04');
