SET FOREIGN_KEY_CHECKS=0;

DROP TABLE IF EXISTS `wst_user_scores`;
CREATE TABLE `wst_user_scores` (
  `scoreId` int(11) NOT NULL AUTO_INCREMENT,
  `userId` int(11) NOT NULL DEFAULT '0',
  `score` int(11) NOT NULL DEFAULT '0',
  `dataSrc` int(11) NOT NULL DEFAULT '0',
  `dataId` int(11) NOT NULL DEFAULT '0',
  `dataRemarks` text,
  `scoreType` int(11) NOT NULL DEFAULT '0',
  `createTime` datetime NOT NULL,
  PRIMARY KEY (`scoreId`),
  KEY `userId` (`userId`),
  KEY `userId_2` (`userId`,`dataSrc`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

INSERT INTO `wst_user_scores` VALUES ('1', '35', '18', '1', '1', '交易订单【100000003】获得积分18个', '1', '2016-12-26 10:56:18'),
('2', '34', '347', '1', '5', '交易订单【100000040】获得积分347个', '1', '2016-12-26 16:32:57'),
('3', '34', '5', '1', '5', '评价订单【100000040】获得积分5个', '1', '2016-12-26 16:34:28'),
('4', '34', '369', '1', '6', '交易订单【100000051】获得积分369个', '1', '2016-12-26 16:39:56'),
('5', '34', '5', '1', '6', '评价订单【100000051】获得积分5个', '1', '2016-12-26 16:40:31'),
('6', '34', '601', '1', '9', '交易订单【100000084】获得积分601个', '1', '2016-12-26 16:42:47'),
('7', '34', '8', '1', '8', '交易订单【100000073】获得积分8个', '1', '2016-12-26 16:42:49'),
('8', '34', '356', '1', '7', '交易订单【100000062】获得积分356个', '1', '2016-12-26 16:42:52'),
('9', '34', '5', '1', '9', '评价订单【100000084】获得积分5个', '1', '2016-12-26 16:44:19'),
('10', '32', '2291', '1', '10', '交易订单【100000095】获得积分2291个', '1', '2016-12-27 10:31:22'),
('11', '32', '5', '1', '10', '评价订单【100000095】获得积分5个', '1', '2016-12-27 10:37:27'),
('12', '32', '428', '1', '11', '交易订单【100000106】获得积分428个', '1', '2016-12-27 10:54:32'),
('13', '34', '7656', '1', '12', '交易订单【100000110】获得积分7656个', '1', '2016-12-27 11:39:58'),
('14', '34', '5', '1', '12', '评价订单【100000110】获得积分5个', '1', '2016-12-27 11:45:50'),
('15', '34', '5', '1', '7', '评价订单【100000062】获得积分5个', '1', '2016-12-27 11:47:41'),
('16', '34', '455', '1', '13', '交易订单【100000121】获得积分455个', '1', '2016-12-27 11:47:45'),
('17', '34', '5', '1', '13', '评价订单【100000121】获得积分5个', '1', '2016-12-27 11:48:29');
